[
  {
    "version": "0.19.0",
    "date": "2026-02-10",
    "githubUrl": "https://github.com/neogenz/pulpe/releases/tag/v0.19.0",
    "platforms": ["web", "ios"],
    "changes": {
      "features": [
        {
          "title": "Restriction des dates de previsions",
          "description": "Les dates de debut et fin des previsions sont desormais limitees a la periode du mois en cours"
        },
        {
          "title": "Page changelog",
          "description": "Nouvelle page changelog sur le site vitrine avec liens vers les releases GitHub"
        }
      ],
      "fixes": [
        {
          "title": "Calcul des depenses realisees",
          "description": "Correction du double comptage des depenses realisees dans le budget"
        },
        {
          "title": "Mode maintenance",
          "description": "Le garde de maintenance fonctionne en fail-open pour eviter les faux blocages"
        },
        {
          "title": "Session iOS",
          "description": "Correction d'une boucle infinie de retry lors d'une session expiree"
        }
      ],
      "technical": [
        {
          "title": "Migration base de donnees",
          "description": "Migration vers une nouvelle base de donnees"
        },
        {
          "title": "Protection IP",
          "description": "Ajout d'un middleware de blocage IP et renforcement du rate limiting"
        },
        {
          "title": "Compatibilite Supabase",
          "description": "Prise en charge du nouveau format de cle publique Supabase"
        }
      ]
    }
  },
  {
    "version": "0.18.0",
    "date": "2026-01-30",
    "githubUrl": "https://github.com/neogenz/pulpe/releases/tag/v0.18.0",
    "headline": "Premiere release officielle",
    "description": "Pulpe est une application de gestion budgetaire personnelle pour le marche suisse. Cette premiere release regroupe l'ensemble des fonctionnalites developpees depuis la creation du projet.",
    "platforms": ["web", "ios"],
    "changes": {
      "features": [
        {
          "title": "Planification budgetaire",
          "description": "Modeles de mois reutilisables, generation automatique des budgets mensuels, report du solde entre les mois (rollover), alertes de depassement a 80%, 90% et 100%."
        },
        {
          "title": "Suivi mensuel",
          "description": "Ajout de transactions manuelles, vue claire du disponible a depenser, cochage des previsions realisees, distinction plan vs realite."
        },
        {
          "title": "Onboarding",
          "description": "Creation guidee du premier budget en quelques etapes, mode demo avec donnees realistes (session 24h, sans inscription)."
        },
        {
          "title": "Application iOS",
          "description": "App native SwiftUI avec navigation fluide, tableau de bord avec vue d'ensemble du mois, gestion des budgets et transactions depuis mobile."
        },
        {
          "title": "Application web",
          "description": "Interface Angular responsive mobile-first, pages d'authentification alignees avec le design system, navigation par mois avec barre de progression temporelle."
        },
        {
          "title": "Landing page",
          "description": "Page d'accueil Next.js avec presentation du produit, pages legales (confidentialite, CGU), page support."
        },
        {
          "title": "Export Excel",
          "description": "Export des budgets en Excel avec formatage des montants et totaux automatiques."
        },
        {
          "title": "Suppression de compte",
          "description": "Possibilite de supprimer son compte avec un delai de grace de 3 jours."
        }
      ],
      "fixes": [],
      "technical": [
        {
          "title": "Backend et infrastructure",
          "description": "API NestJS avec Supabase (PostgreSQL + Auth), schemas partages (Zod), mode maintenance configurable, journalisation RGPD."
        }
      ]
    }
  }
]
